# مجموعهٔ نقش‌ها و مسیر تخته برای تعداد متفاوت بازیکنان
playerSets = {
    3: {  # فقط برای تست
        "roles": [
            'لیبرال',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            None,
            'سیاست',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    4: {  # فقط برای تست
        "roles": [
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            None,
            'سیاست',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    5: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            None,
            'سیاست',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    6: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            None,
            'سیاست',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    7: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            'بازرسی',
            'انتخاب',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    8: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            None,
            'بازرسی',
            'انتخاب',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    9: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'فاشیست',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            'بازرسی',
            'بازرسی',
            'انتخاب',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
    10: {
        "roles": [
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'لیبرال',
            'فاشیست',
            'فاشیست',
            'فاشیست',
            'هیتلر'
        ],
        "track": [
            'بازرسی',
            'بازرسی',
            'انتخاب',
            'اعدام',
            'اعدام',
            'پیروزی'
        ]
    },
}

# بستهٔ سیاست‌ها
policies = [
    'لیبرال',
    'لیبرال',
    'لیبرال',
    'لیبرال',
    'لیبرال',
    'لیبرال',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست',
    'فاشیست'
]
